Revit 2027 API
RevisionsOnSheetUIServiceData.Document Property
 return the document
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Document Document { get; }
Public ReadOnly Property Document As Document
	Get
public:
property Document^ Document {
	Document^ get ();
}
member Document : Document with get
Property Value
Document
See Also
Reference
RevisionsOnSheetUIServiceData Class
Autodesk.Revit.UI Namespace